// Задача 11 "Программа выводит случайное трехзначное число и удаляет вторую цифру этого числа"

// Random random = new Random();
// int randomNumber = random.Next(100,1000); 

// Console.WriteLine(randomNumber);

// int lastNumber = randomNumber % 10;
// int firstNumber = randomNumber / 100;

// int itog = firstNumber * 10 + lastNumber;

// Console.WriteLine(itog);



// Задача 12 "Программа принимает два числа и определяет, является ли второе число кратным первому. Если число не кратно - выводим остаток от деления"

// Console.WriteLine("Ведите два числа:");
// int numA = Convert.ToInt32(Console.ReadLine());
// int numB = Convert.ToInt32(Console.ReadLine());
// int ost = numA % numB;

// if(numA % numB == 0)
// {
//     Console.WriteLine("Второе число кратно первому");
// }
// else
// {
//     Console.WriteLine(ost);
// }



// Задача 14 "Программа принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23"

// Console.Write("Ведите число: ");
// int numA = Convert.ToInt32(Console.ReadLine());

// bool checkKrat(int numA)
// {
//     if(numA % 7 == 0 && numA % 23 == 0)
//     {
//         return true;
//     }
//     else
//     {
//         return false;
//     }
// }
// bool result = checkKrat(numA);
// if(result == true)
// {
//     Console.WriteLine("Кратно");
// }
// else
// {
//     Console.WriteLine("Не кратно");
// }


